---
type: DefaultDivideSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# DefaultDivideSettings

`Autodesk.Revit.DB.DefaultDivideSettings` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDefaultDivideSettings | 2014 | `public static DefaultDivideSettings GetDefaultDivideSettings ( Document cda )` |
| Method | GetSurfaceDistance | 2015 | `public double GetSurfaceDistance ( UVGridlineType gridlines )` |
| Method | GetSurfaceLayout | 2015 | `public SpacingRuleLayout GetSurfaceLayout ( UVGridlineType gridlines )` |
| Method | GetSurfaceNumber | 2015 | `public int GetSurfaceNumber ( UVGridlineType gridlines )` |
| Method | SetSurfaceDistance | 2015 | `public void SetSurfaceDistance ( UVGridlineType gridlines , double distance )` |
| Method | SetSurfaceLayout | 2015 | `public void SetSurfaceLayout ( UVGridlineType gridlines , SpacingRuleLayout layout )` |
| Method | SetSurfaceNumber | 2015 | `public void SetSurfaceNumber ( UVGridlineType gridlines , int number )` |
| Property | Parameter | — | `` |
| Property | PathDistance | 2015 | `public double PathDistance { get ; set ; }` |
| Property | PathLayout | 2015 | `public SpacingRuleLayout PathLayout { get ; set ; }` |
| Property | PathMeasurementType | 2015 | `public DividedPathMeasurementType PathMeasurementType { get ; set ; }` |
| Property | PathNumber | 2015 | `public int PathNumber { get ; set ; }` |